# 3

//Напишите программу вычисляющую среднее арифметичское последовательности чисел. Длина прследовательности неизвестна, однако последовательность оканчивается нулем и других нулевых значений не встречается. 

#include <iostream>
using namespace std;
int main() {

	int a, i, b;
	a = 0;
	cin >> b;

	for (i = 1; b != 0; i++) {

		
		a = a + b;
		cin >> b;

	}


	cout << (a / i);

	return 0;



}
